In [1]:
import pandas as pd

### 1. Actors and Directors Who Cooperated At Least Three Times

Table: ActorDirector
   

| Column Name | Type |
|-------------|------|
| actor_id    | int  |
| director_id | int  |
| timestamp   | int  |

timestamp is the primary key column for this table.
 

Write a SQL query for a report that provides the pairs (actor_id, director_id) where the actor have cooperated with the director at least 3 times.

Example:

ActorDirector table:  
 
| actor_id    | director_id | timestamp   |  
|---------------------------------------|  
| 1           | 1           | 0           |  
| 1           | 1           | 1           |  
| 1           | 1           | 2           |  
| 1           | 2           | 3           |  
| 1           | 2           | 4           |  
| 2           | 1           | 5           |  
| 2           | 1           | 6           |  


Result table:  
 
| actor_id    | director_id |  
|--------------------------|  
| 1           | 1           |  
  
The only pair is (1, 1) where they cooperated exactly 3 times.

In [ ]:
# SQL:
# SELECT actor_id AS ACTOR_ID, director_id AS DIRECTOR_ID
# FROM ActorDirector
# GROUP BY actor_id, director_id
# HAVING(COUNT(timestamp)>=3)

In [171]:
# Create the sample table
ActorDirector = pd.DataFrame({'actor_id':[1, 1, 1, 1, 1, 2, 2],
                 'director_id':[1, 1, 1, 2, 2, 1, 1],
                'timestamp':[0, 1, 2, 3, 4, 5, 6]})

ActorDirector.head()

   actor_id  director_id  timestamp
0         1            1          0
1         1            1          1
2         1            1          2
3         1            2          3
4         1            2          4

In [173]:
# groupby 'actor_id' and 'director_id', 
# counting the number of elements per group, 
# reseting the index to remove the nested columns 
temp1 = ActorDirector.groupby(by=['actor_id', 'director_id']).count().reset_index()

# filter: keep groups who have more than 2 instances,
# display the output
grouped = temp1.loc[temp1.timestamp>=3, ['actor_id', 'director_id']]
grouped

   actor_id  director_id
0         1            1

### 2. Sales Analysis I
Table: Product

| Column Name  | Type    |
|-----------------------
| product_id   | int     |
| product_name | varchar |
| unit_price   | int     |

product_id is the primary key of this table.

Table: Sales

| Column Name | Type    |
|-------------|---------|
| seller_id   | int     |
| product_id  | int     |
| buyer_id    | int     |
| sale_date   | date    |
| quantity    | int     |
| price       | int     |

This table has no primary key, it can have repeated rows.
product_id is a foreign key to Product table.
 

Write an SQL query that reports the best seller by total sales price, If there is a tie, report them all.

The query result format is in the following example:

Product table:

| product_id | product_name | unit_price |
|------------|--------------|------------|
| 1          | S8           | 1000       |
| 2          | G4           | 800        |
| 3          | iPhone       | 1400       |


Sales table:

| seller_id | product_id | buyer_id | sale_date  | quantity | price |
|-----------|------------|----------|------------|----------|-------|
| 1         | 1          | 1        | 2019-01-21 | 2        | 2000  |
| 1         | 2          | 2        | 2019-02-17 | 1        | 800   |
| 2         | 2          | 3        | 2019-06-02 | 1        | 800   |
| 3         | 3          | 4        | 2019-05-13 | 2        | 2800  |


Result table:

| seller_id   |
|-------------|
| 1           |
| 3           |

Both sellers with id 1 and 3 sold products with the most total price of 2800.

In [ ]:
# SQL:
#SELECT seller_id
#FROM Sales
#GROUP BY seller_id
#HAVING sum(price) = 
#(
#    SELECT sum(price)
#    FROM sales
#    group by seller_id
#    order by sum(price) desc
#    limit 1
#)

In [ ]:
# Python equivalent:

In [28]:
# 1. Create the sample table
Sales = pd.DataFrame({'seller_id':[1, 1, 2, 3],
                     'product_id':[1, 2,2, 3],
                     'buyer_id': [1, 2, 3, 4],
                     'sale_date': ['2019-01-21', '2019-02-17', '2019-06-02','2019-05-13'],
                     'quantity':[2, 1, 1, 2],
                     'price': [2000, 800, 800, 2800]})
Sales

   seller_id  product_id  buyer_id   sale_date  quantity  price
0          1           1         1  2019-01-21         2   2000
1          1           2         2  2019-02-17         1    800
2          2           2         3  2019-06-02         1    800
3          3           3         4  2019-05-13         2   2800

In [29]:
# Group by seller_id
grouped = Sales.groupby(by='seller_id')['price'].sum().reset_index()
grouped

   seller_id  price
0          1   2800
1          2    800
2          3   2800

In [30]:
# Find max
max_price = max(grouped.price)

In [39]:
# Filter grouped table using max_price
filtered = grouped.loc[grouped.price==max_price, ['seller_id']]
filtered

   seller_id
0          1
2          3